{
  "id": "7d768380-dc71-4d95-8e46-0e12b60c85bd",
  "instructions": "Experiment Configuration:\n\nSystem Specification:\n- Plant Type: quadcopter3D\n- Control Inputs: roll, pitch, throttle\n- Control Ranges: {\n  \"pitch\": {\n    \"max\": 0.5,\n    \"min\": -0.5,\n    \"unit\": \"radians\"\n  },\n  \"roll\": {\n    \"max\": 0.5,\n    \"min\": -0.5,\n    \"unit\": \"radians\"\n  },\n  \"throttle\": {\n    \"max\": 1,\n    \"min\": 0,\n    \"unit\": \"percent\"\n  }\n}\n- Objective: Hold position at [0, 0, 5m] for 10s\n- Constraints: Wind gust ±2m/s, Sample time 0.02s\n- Visualization: offline 3D\n\nSelected Controllers:\n\nLQR Controller (Position):\n- Description: An LQR controller is suitable for the overall position control loop. It can handle the coupled dynamics of the quadcopter and provide optimal control inputs (roll, pitch, throttle) to reach and maintain the desired position, given the system dynamics and cost function. It requires a linear model of the quadcopter, which can be locally linearized around the hover point. The wind gust constraint adds uncertainty, potentially reducing performance, but the LQR can be designed to be robust. This will output roll and pitch commands to the roll/pitch PID controllers.\n- Parameters: {\n  \"Q\": [\n    1,\n    1,\n    1\n  ],\n  \"R\": [\n    0.1,\n    0.1,\n    0.1\n  ]\n}\n\n\nPID Controller (Altitude):\n- Description: A PID controller is suitable for altitude control (throttle) in the presence of moderate wind gusts. It provides stable and responsive control for maintaining the desired altitude. The 'throttle' control input directly influences the vertical thrust, making PID a good fit. Tuning the gains (Kp, Ki, Kd) is crucial for optimal performance.\n- Parameters: {\n  \"Kp\": 0.5,\n  \"Ki\": 0.1,\n  \"Kd\": 0.2\n}\n\n\nPID Controller (Roll/Pitch):\n- Description: PID controllers are suitable for roll and pitch control to maintain the desired horizontal position. These controllers will be cascaded with a higher-level position controller. The fast sample time (0.02s) allows for responsive feedback. Similar to altitude, tuning the gains will be necessary to achieve desired performance in the presence of wind.\n- Parameters: {\n  \"Kp\": 1,\n  \"Ki\": 0.2,\n  \"Kd\": 0.3\n}\n\n\n\n\nPlease implement and evaluate these controllers according to the specification.",
  "status": "started",
  "startTime": "2025-05-10T15:51:14.854Z"
}